//=================================================================================================
//
//	Demo ヘッダファイル
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"
#include "../FtgMain/FtgConst.h"	
#include "../FtgMain/MutualChara.h"
#include "../GameMain/Scene.h"

//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	class Demo : public Scene
	{
		P_GrpAcv		m_bg;			//背景
		P_GrpAcv		m_training;		//トレーニング表示

		//画面固定システム表示
		//ゲージ枠
		P_GrpAcv		m_gauge_frame;

		//キャラ相互処理
		P_MutualChara	m_mutualChara;

		//ポーズ
		P_GrpAcv		m_pause;

	public:
		Demo ();
		Demo ( const Demo & rhs ) = delete;
		~Demo ();

		void ParamInit ();
		void Init ();
		void Move ();

		P_GameScene Transit ();

	private:
		void Pause ();
	};


}	//namespace GAME


