//=================================================================================================
//
//	EfHit ソースファイル
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "EfHit.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	EfHit::EfHit ()
	{
		AddTexture ( _T ( "Ef_Hit.png" ) );
		SetStartScaling ( VEC2 ( 1.f, 1.f ) );
		SetTargetScaling ( VEC2 ( 2.f, 2.f ) );
		SetRotationCenter ( VEC2 ( 256.f, 256.f ) );
		SetVel ( VEC2 ( 0.1f, 1.f ) );
	}

	EfHit::~EfHit ()
	{
	}

	void EfHit::On ( VEC2 center )
	{
		SetDispBase ( G_BASE_POS () );
		SetRevised ( center );
		SetTimer ( 60 );
		SetFadeOut ( 30 );
		SetValid ( true );

		float rad = D3DX_2PI / 360;
		int random = rand () % 360;
		SetRadian ( rad * random );

		GrpEf::On ();
	}

	void EfHit::Move ()
	{

		//画面位置補正
		SetPos ( GetPos () + G_BASE_POS () );

		GrpEf::Move ();
	}
}
